БухЭксп/ChartsOfCharacteristicTypes/CW_ПараметрыГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CW_ПараметрыГрузоперевозок</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Склады</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ЖелезнодорожныеСтанции</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторДОПОГЭПД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_СкладыВременногоХранения</v8:Type>
				<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_РазмерыКонтейнеров</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОфисыКомпании</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Оборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Линии</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Порты</v8:Type>
				<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
				<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Авиалинии</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыДоговоров</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
				<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ГрузоотправителиИГрузополучатели</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыКонтейнеров</v8:Type>
				<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
				<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Суда</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ДополнительныеЗначенияПараметровГрузоперевозок</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МоделиТС</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ПодразделенияКомпании</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Рейсы</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МаркиТС</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторУпаковкиЭПД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Терминалы</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КлассификаторОпасныхГрузов</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Пункты</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Таможни</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыТранспортныхСредств</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_СтатусыОтслеживаемогоОборудования</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Аэропорты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КонтактнаяИнформация</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КонтактыеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>18</v8:Digits>
					<v8:FractionDigits>4</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>600</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантОтбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВариантыОтбораДляПараметров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаОтбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаПередНачаломВыбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеПриИзменении</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ДействияПриИзмененииКонтрольнойДаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДинамическийПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕжедневныйПересчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексПиктограммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеОтбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеУсловногоОформления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормуВводаАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормуВыбораОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяОбработкаПередНачаломВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДополнительныеЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДатаИспользуетВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПросрочкиКонтрольнойДаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественноеПрямоеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьВФормеГрузоперевозок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграниченСпискомЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчищатьПриКопировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрОтметкиУведомления</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодготовленнаяФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьПолноеЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВывода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеУсловногоОформления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВедомыйПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКонтрольнаяДата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСсылочныйТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЧисло</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьПГ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУсловия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыУсловийОтбораПараметров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоступноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВедущиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

БухЭксп/ChartsOfCharacteristicTypes/CW_ПараметрыГрузоперевозок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПолучиьСписокПараметровДляВыводаНаФорму(СоответствиеПараметров, СписокДополнительныхКолонок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Код КАК Код,
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Ссылка,
	               |	CW_ПараметрыГрузоперевозок.Наименование КАК Наименование,
	               |	CW_ПараметрыГрузоперевозок.ЭтоКонтрольнаяДата КАК ЭтоКонтрольнаяДата
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	НЕ CW_ПараметрыГрузоперевозок.Предопределенный
	               |	И НЕ CW_ПараметрыГрузоперевозок.ЭтоГруппа
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПараметры = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаПараметры.Следующий() Цикл
		ИмяКолонки 				= СокрЛП(ВыборкаПараметры.Код);
		ПредставлениеПараметра 	= СокрЛП(ВыборкаПараметры.Наименование);  
		
		СоответствиеПараметров.Вставить(ИмяКолонки, Новый Структура("ЭтоПараметр, Значение,Представление",Истина, ВыборкаПараметры.Ссылка, ПредставлениеПараметра));
		СписокДополнительныхКолонок.Добавить(ИмяКолонки,	ПредставлениеПараметра, Ложь);
		
		Если ВыборкаПараметры.ЭтоКонтрольнаяДата Тогда
			СоответствиеПараметров.Вставить(ИмяКолонки + "_План", Новый Структура("ЭтоПараметр, Значение,Представление",Истина, ВыборкаПараметры.Ссылка, ПредставлениеПараметра + " (План)"));
			СписокДополнительныхКолонок.Добавить(ИмяКолонки + "_План",	ПредставлениеПараметра + " (План)", Ложь);   
			
			СоответствиеПараметров.Вставить(ИмяКолонки + "_Факт", Новый Структура("ЭтоПараметр, Значение,Представление",Истина, ВыборкаПараметры.Ссылка, ПредставлениеПараметра + " (Факт)"));
			СписокДополнительныхКолонок.Добавить(ИмяКолонки + "_Факт",	ПредставлениеПараметра + " (Факт)", Ложь);   
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция - Получить список параметров по типу значения
//
// Параметры:
//  Тип					 			-	тип значения параметров; 
//  ИсключитьПомеченныеНаУдаление	-	исключение из массива помеченных на удаление параметров
// 
// Возвращаемое значение:
//   - Массив ссылок с типом "ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок"
//
Функция ПолучитьСписокПараметровПоТипуЗначения(Тип, ИсключитьПомеченныеНаУдаление=Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CW_ПараметрыГрузоперевозок.Ссылка КАК Ссылка,
	|	CW_ПараметрыГрузоперевозок.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	|ГДЕ
	|	CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	|	//УсловиеПомеченныхНаУдаление";  
	
	Если ИсключитьПомеченныеНаУдаление Тогда
		ТекстЗамены = "И CW_ПараметрыГрузоперевозок.ПометкаУдаления = ЛОЖЬ";
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеПомеченныхНаУдаление", ТекстЗамены);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Массив = Новый Массив;	
	Пока Выборка.Следующий() Цикл
		Если  Выборка.ТипЗначения.СодержитТип(Тип) Тогда
			Массив.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция ПолучитьСвойстваПараметров(МассивПараметров) Экспорт
	
	Пользователь 				= ПараметрыСеанса.ТекущийПользователь;
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь,Истина);
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(Пользователь);
	Если (ГруппаПользователя = Неопределено) Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.ПустаяСсылка();
	КонецЕсли; 
	Если (ГруппаПользователя.ПолныеПрава) Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПараметрыГрузоперевозок.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА ПараметрыГрузоперевозок.ДинамическийПараметр
	               |			ТОГДА 3
	               |		КОГДА ПараметрыГрузоперевозок.ЭтоКонтрольнаяДата
	               |			ТОГДА 2
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ИндексКартинки,
	               |	ВЫБОР
	               |		КОГДА &ПолныеПрава
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЕСТЬNULL(CW_ПраваДоступаДляПараметровМониторинга.Просмотр, ЛОЖЬ)
	               |	КОНЕЦ КАК Просмотр,
	               |	ВЫБОР
	               |		КОГДА &ПолныеПрава
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЕСТЬNULL(CW_ПраваДоступаДляПараметровМониторинга.Редактирование, ЛОЖЬ)
	               |	КОНЕЦ КАК Редактирование,
	               |	ПараметрыГрузоперевозок.ДинамическийПараметр КАК ЭтоДинамическийПараметр,
	               |	ПараметрыГрузоперевозок.КонтрольнаяДатаИспользуетВремя КАК КонтрольнаяДатаИспользуетВремя,
	               |	ПараметрыГрузоперевозок.ЭтоКонтрольнаяДата КАК ЭтоКонтрольнаяДата,
	               |	ПараметрыГрузоперевозок.НеПоказыватьВФормеГрузоперевозок КАК ПараметрНеПоказыватьВФормеГрузоперевозок,
	               |	ПараметрыГрузоперевозок.ОбработкаИзменения КАК ЕстьОбработкаИзменения,
	               |	ПараметрыГрузоперевозок.ИспользуетсяОбработкаПередНачаломВыбора КАК ЕстьОбработкаПередНачаломВыбора,
	               |	ПараметрыГрузоперевозок.ИспользоватьФормуВыбораОбъекта КАК РедактироватьВСтроке,
	               |	ПараметрыГрузоперевозок.НеПоказыватьВФормеГрузоперевозок КАК СкрыватьВДереве,
	               |	ПараметрыГрузоперевозок.ЭтоВедомыйПараметр КАК ЕстьВедущие,
	               |	ПараметрыГрузоперевозок.ФорматВывода КАК ФорматВывода
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК ПараметрыГрузоперевозок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПраваДоступаДляПараметровМониторинга КАК CW_ПраваДоступаДляПараметровМониторинга
	               |		ПО ПараметрыГрузоперевозок.Ссылка = CW_ПраваДоступаДляПараметровМониторинга.Параметр
	               |			И (CW_ПраваДоступаДляПараметровМониторинга.Группа = &ГруппаПользователя)
	               |ГДЕ
	               |	ПараметрыГрузоперевозок.Ссылка В(&МассивПараметров)";
	
	Запрос.УстановитьПараметр("МассивПараметров", 	МассивПараметров);
	Запрос.УстановитьПараметр("ГруппаПользователя", ГруппаПользователя);
	Запрос.УстановитьПараметр("ПолныеПрава", 		ЭтоПолноправныйПользователь или ГруппаПользователя.ПолныеПрава);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

// Функция - ПолучитьМассивВедомыхПараметров(Параметр)
//
// Параметры:
//  Параметр - 	 Параметр, для которого будутполучены выдомые параметры 
// 
// Возвращаемое значение:
//   - массив ведомых параметров
//
Функция ПолучитьМассивВедомыхПараметров(Параметр) Экспорт

	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВедущиеПараметры.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ВедущиеПараметры КАК ВедущиеПараметры
	               |ГДЕ
	               |	ВедущиеПараметры.Параметр = &Параметр";
	
	Запрос.УстановитьПараметр("Параметр", Параметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции  

//Шаблоны стандартных писем
Процедура ДополнитьМакросыПараметровГрузоперевозок(ГруппаМакросов) Экспорт

	Запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Ссылка,
	               |	CW_ПараметрыГрузоперевозок.Наименование КАК Наименование,
	               |	CW_ПараметрыГрузоперевозок.ТипЗначения КАК ТипЗначения,
	               |	CW_ПараметрыГрузоперевозок.Идентификатор КАК Идентификатор,
	               |	CW_ПараметрыГрузоперевозок.ИдентификаторПлан КАК ИдентификаторПлан,
	               |	CW_ПараметрыГрузоперевозок.ИдентификаторФакт КАК ИдентификаторФакт
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.Служебный = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Идентификатор
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		КартинкаТипа = ИндексКартинкиТипа(Выборка.ТипЗначения);   
		
		ДобавитьСтрокуМакросов(ГруппаМакросов,"["+СокрЛП(Выборка.Идентификатор) + "]", СокрЛП(Выборка.Идентификатор) , КартинкаТипа);
		
		Если Не ПустаяСтрока(СокрЛП(Выборка.ИдентификаторПлан)) Тогда
			ПредставлениеПараметра = СтрЗаменить(СокрЛП(Выборка.ИдентификаторПлан), "_ЗначениеПлан", " (План)");
			ДобавитьСтрокуМакросов(ГруппаМакросов,"["+СокрЛП(Выборка.ИдентификаторПлан) + "]", ПредставлениеПараметра , КартинкаТипа);
		КонецЕсли;
		Если Не ПустаяСтрока(СокрЛП(Выборка.ИдентификаторФакт)) Тогда
			ПредставлениеПараметра = СтрЗаменить(СокрЛП(Выборка.ИдентификаторФакт), "_ЗначениеФакт", " (Факт)");
			ДобавитьСтрокуМакросов(ГруппаМакросов,"["+СокрЛП(Выборка.ИдентификаторФакт) + "]", ПредставлениеПараметра , КартинкаТипа);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ДобавитьСтрокуМакросов(ГруппаМакросов, Значение, Представление, ИндексКартинки)
	
	СтрокаМакроса = ГруппаМакросов.Строки.Добавить();
	СтрокаМакроса.ИндексКартинки 	= ИндексКартинки;
	СтрокаМакроса.Значение 			= Значение;
	СтрокаМакроса.Представление 	= Представление;
	СтрокаМакроса.ЭтоГруппа 		= Ложь;
	
КонецПроцедуры

Процедура ОписаниеМакросовПараметровГрузоперевозок(Результат) Экспорт	

	Запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Ссылка,
	               |	CW_ПараметрыГрузоперевозок.Наименование КАК Наименование,
	               |	CW_ПараметрыГрузоперевозок.Идентификатор КАК Идентификатор,
	               |	CW_ПараметрыГрузоперевозок.ИдентификаторПлан КАК ИдентификаторПлан,
	               |	CW_ПараметрыГрузоперевозок.ИдентификаторФакт КАК ИдентификаторФакт,
	               |	CW_ПараметрыГрузоперевозок.ТипЗначения КАК ТипЗначения
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.Служебный = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Идентификатор 	= "["+СокрЛП(Выборка.Идентификатор) + "]";
		ИмяФункции 		= "МенеджерОбъектаШаблона.ПолучитьЗначениеПараметра(Источник, """+Идентификатор+""", ""Значение"", СоответствиеПараметров)";
		Результат.Вставить(Идентификатор,	ИмяФункции);
		
		Если Не ПустаяСтрока(СокрЛП(Выборка.ИдентификаторПлан)) Тогда
			ИдентификаторПлан 	= "["+СокрЛП(Выборка.ИдентификаторПлан) + "]";
			ИмяФункцииПлан 		= "МенеджерОбъектаШаблона.ПолучитьЗначениеПараметра(Источник, """+ИдентификаторПлан+""", ""ЗначениеПлан"", СоответствиеПараметров)";
			Результат.Вставить(ИдентификаторПлан,	ИмяФункцииПлан);
		КонецЕсли;	
		Если Не ПустаяСтрока(СокрЛП(Выборка.ИдентификаторФакт)) Тогда
			ИдентификаторФакт 	= "["+СокрЛП(Выборка.ИдентификаторФакт) + "]";
			ИмяФункцииФакт 		= "МенеджерОбъектаШаблона.ПолучитьЗначениеПараметра(Источник, """+ИдентификаторФакт+""", ""ЗначениеФакт"", СоответствиеПараметров)";
			Результат.Вставить(ИдентификаторФакт,	ИмяФункцииФакт);
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры  

Функция ПолучитьСоответствиеПараметров() Экспорт
	
	Соответствие = Новый Соответствие;

	Запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Ссылка,
	               |	CW_ПараметрыГрузоперевозок.ТипЗначения КАК ТипЗначения,
	               |	CW_ПараметрыГрузоперевозок.Идентификатор КАК Идентификатор,
	               |	CW_ПараметрыГрузоперевозок.ИдентификаторПлан КАК ИдентификаторПлан,
	               |	CW_ПараметрыГрузоперевозок.ИдентификаторФакт КАК ИдентификаторФакт
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.Служебный = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Соответствие.Вставить("["+СокрЛП(Выборка.Идентификатор+"]"), Выборка.Ссылка);
		
		Если Не ПустаяСтрока(СокрЛП(Выборка.ИдентификаторПлан)) Тогда
			Соответствие.Вставить("["+СокрЛП(Выборка.ИдентификаторПлан)+"]", Выборка.Ссылка);
		КонецЕсли;
		Если Не ПустаяСтрока(СокрЛП(Выборка.ИдентификаторФакт)) Тогда
			Соответствие.Вставить("["+СокрЛП(Выборка.ИдентификаторФакт)+"]", Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции 

Функция ИндексКартинкиТипа(ОписаниеТипов)
	
	ИндексКартинки = 8;
	Если ОписаниеТипов.Типы().Количество() = 1 Тогда
		Тип = ОписаниеТипов.Типы()[0];
		Если Тип = Тип("Число") Тогда
			ИндексКартинки = 1;
		ИначеЕсли Тип = Тип("Дата") Тогда
			ИндексКартинки = 2;
		ИначеЕсли Тип = Тип("Булево") Тогда
			ИндексКартинки = 3;
		ИначеЕсли Тип = Тип("Строка") Тогда
			ИндексКартинки = 4;
		ИначеЕсли ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
			ИндексКартинки = 5;
		ИначеЕсли Тип = Тип("УникальныйИдентификатор") Тогда
			ИндексКартинки = 6;
		КонецЕсли;
	ИначеЕсли ОписаниеТипов.Типы().Количество() > 1 Тогда
		ИндексКартинки = 7;
	КонецЕсли;
	
	Возврат ИндексКартинки;
	
КонецФункции 

Функция КартинкаТипа(ОписаниеТипов)
	
	Картинка = БиблиотекаКартинок.ТипНеопределено;
	Если ОписаниеТипов.Типы().Количество() = 1 Тогда
		Тип = ОписаниеТипов.Типы()[0];
		Если Тип = Тип("Число") Тогда
			Картинка = БиблиотекаКартинок.ТипЧисло;
		ИначеЕсли Тип = Тип("Дата") Тогда
			Картинка = БиблиотекаКартинок.ТипДата;
		ИначеЕсли Тип = Тип("Булево") Тогда
			Картинка = БиблиотекаКартинок.ТипБулево;
		ИначеЕсли Тип = Тип("Строка") Тогда
			Картинка = БиблиотекаКартинок.ТипСтрока;
		ИначеЕсли ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
			Картинка = БиблиотекаКартинок.ТипСсылка;
		ИначеЕсли Тип = Тип("УникальныйИдентификатор") Тогда
			Картинка = БиблиотекаКартинок.ТипИдентификатор;
		КонецЕсли;
	ИначеЕсли ОписаниеТипов.Типы().Количество() > 1 Тогда
		Картинка = БиблиотекаКартинок.ТипСоставнойОсновной;
	КонецЕсли;
	
	Возврат Картинка;
	
КонецФункции  
//---Шаблоны стандартных писем

Функция ПолучитьИндексПиктограммыПараметра(Знач Ссылка) Экспорт 
	
	Если Ссылка.ЭтоГруппа Тогда
		Возврат 14;
	КонецЕсли;  
	
	Если Ссылка.ЭтоКонтрольнаяДата Тогда
		Возврат 3;
	КонецЕсли;   
	
	Если Ссылка.ДинамическийПараметр Тогда
		Возврат 12;                                                                       
	КонецЕсли;
	
	Возврат ВариантыОтчетовСлужебныйКлиентСервер.ИндексКартинкиПоля(Ссылка.ТипЗначения);
	
КонецФункции
//Обновление версии
Процедура ЗаполнитьСписокВедущихИВедомыхПараметров() Экспорт
	
	ТаблицаМакросов = CW_Мониторинг.СписокМакросовДинамическихПараметров();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Ссылка,
	               |	CW_ПараметрыГрузоперевозок.Формула КАК Формула
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.ДинамическийПараметр = ИСТИНА
	               |	И CW_ПараметрыГрузоперевозок.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ВедущиеПараметры = Новый СписокЗначений;
		
		МакросыФормулы = _сф.стр_СписокМакросов(Выборка.Формула,"{}");
		Для Каждого ЭлементМассива из МакросыФормулы Цикл
			ИмяМакроса = "{"+ЭлементМассива+"}";
			
			Отбор = Новый Структура("Макрос", ИмяМакроса);
			мСтрока = ТаблицаМакросов.НайтиСтроки(Отбор);
			Если мСтрока.Количество() > 0 Тогда
				//Всегда одна строка
				НайденнаяСтрока = мСтрока[0];
				ДобавитьПараметрВСписок(ВедущиеПараметры, НайденнаяСтрока.Параметр);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВедущиеПараметры.Количество() > 0 Тогда
			ПараметрОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПараметрОбъект.ВедущиеПараметры.Очистить();
			Для Каждого ЭлементСписка из ВедущиеПараметры Цикл
				НоваяСтрока = ПараметрОбъект.ВедущиеПараметры.Добавить();
				НоваяСтрока.Параметр = ЭлементСписка.Значение;
			КонецЦикла;
			
			ПараметрОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры
	
Процедура ДобавитьПараметрВСписок(ВедущиеПараметры, ТекущийПараметр)
	
	Если ВедущиеПараметры.НайтиПоЗначению(ТекущийПараметр) = Неопределено Тогда
		
		ВедущиеПараметры.Добавить(ТекущийПараметр);
		Для Каждого СтрокаВедущего из ТекущийПараметр.ВедущиеПараметры Цикл
			ДобавитьПараметрВСписок(ВедущиеПараметры, СтрокаВедущего.Параметр);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
//Обновление версии



#КонецЕсли
